export const data = {
  users: [
    {
      id: 1,
      email: "ahmad123@gmail.com",
      username: "ahmad123",
      password: "1234567",
    },
    {
      id: 2,
      email: "ahmad1234@gmail.com",
      username: "ahmad1234",
      password: "12345678",
    },
    {
      id: 3,
      email: "ahmad1235@gmail.com",
      username: "ahmad1235",
      password: "12345679",
    },
    {
      id: 4,
      email: "ahmad1236@gmail.com",
      username: "ahmad1236",
      password: "12345671",
    },
  ],

  questions: [
    {
      id: "1",
      question: "يتم وضع الأهداف النهائية لمهمة التدقيق بعد ؟",
      choices: [
        "مراجعة تقييم المخاطر على مستوى المؤسسة .",
        "مراجعة وضع خطة التدقيق السنوية .",
        "إجراء تقييم المخاطر للناحية الخاضعة للتدقيق .",
        "التفاوض مع لجنة التدقيق حولها .",
      ],
      correctAnswer: "إجراء تقييم المخاطر للناحية الخاضعة للتدقيق .",
    },
    {
      id: "2",
      question:
        "يستطيع المدقق الداخلي تقييم وظيفة الإدارة في التخطيط من خلال تحديد ؟",
      choices: [
        "مسؤوليات المديرين والصلاحيات المفوضة لهم .",
        "فيما إذا كانت تعويضات الموظفين متناسبة مع الجدول الذي يصنف حدود التعويضات للموظف حسب درجته الوظيفية .",
        "فيما إذا كانت كل خطة من خطط الإدارة تتضمن وسائل لقياس مدى نجاح في تلك الخطة .",
        "فيما إذا كان قد تم وضع وتعميم معايير أداء جديدة عندما تصبح المعايير القديمة غير كافية أو غير فعالة .",
      ],
      correctAnswer:
        "فيما إذا كانت كل خطة من خطط الإدارة تتضمن وسائل لقياس مدى نجاح في تلك الخطة .",
    },
    {
      id: "3",
      question:
        "خلال أي مرحلة عملية التدقيق يقوم المدقق بتحديد الأهداف والضوابط الرقابية ذات العلاقة بالنشاط الخاضع للتدقيق ؟",
      choices: [
        "الاستقصاء التمهيدي .",
        "اختيار كادر التدقيق .",
        "إعداد برنامج التدقيق .",
        "إصدار تقرير التدقيق .",
      ],
      correctAnswer: "الاستقصاء التمهيدي .",
    },
    {
      id: "4",
      question:
        "أي من التالي يعتبر الشرح الأفضل للفرق بين أهداف التدقيق وإجراءات التدقيق ؟",
      choices: [
        "إجراءات التدقيق تحدد الأهداف العامة الواسعة ، أما أهداف التدقيق فتحدد العمل الواجب القيام به بشكل مفصل .",
        "يتم وضع أهداف التدقيق لكل مهمة على حدة ، إجراءات التدقيق تعتبر عامة من حيث التطبيق .",
        "أهداف التدقيق تحدد الإنجازات المحددة المطلوبة ، إجراءات التدقيق تحدد الطرق لتحقيق هذه الأهداف .",
        "إجراءات التدقيق وأهداف التدقيق متشابهة من حيث المبدأ .",
      ],
      correctAnswer:
        "أهداف التدقيق تحدد الإنجازات المحددة المطلوبة ، إجراءات التدقيق تحدد الطرق لتحقيق هذه الأهداف .",
    },
    {
      id: "5",
      question:
        "يضع المدقق الداخلي أهداف التدقيق عند التخطيط للتدقيق كي يحدد ما يجب إنجازه . أي مما يلي هو مسألة هامة يجب أخذها بعين الاعتبار عند وضع أهداف التدقيق ؟",
      choices: [
        "مؤهلات كادر التدقيق الذي سوف يقوم بالمهمة .",
        "أهداف الجهة الخاضعة للتدقيق وبنية الرقابة لديها .",
        "اقتراحات موظفي القسم الخاضع للتدقيق .",
        "الجهات التي ستتلقى تقرير التدقيق .",
      ],
      correctAnswer: "أهداف الجهة الخاضعة للتدقيق وبنية الرقابة لديها .",
    },
    {
      id: "6",
      question:
        "أظهرت مرحلة الاستقصاء التمهيدي للتدقيق على نشاط التوظيف أن مصاريف الفنادق والطيران تقريباً متساوية . تقوم سكرتيرة قسم التوظيف بحجوزات الفنادق والطيران . بناء على هذه المعلومات يجب أن يتضمن نطاق التدقيق ؟",
      choices: [
        "الأخذ بعين الاعتبار عوامل المنافسة المستخدمة في اختيار الفنادق .",
        "الاقتراح أن يقوم شخص آخر خارج قسم التوظيف بالقيام بحجوزات الفنادق والطيران .",
        "مقارنة تفاصلي مصاريف الفندق لكل متقدم في التقارير مع نسخ من الفواتير الصادرة عن الفندق مباشرة .",
        "الحصول على تأكيدات أن الحقوق القانونية للمتقدمين محمية عند إجراء المقابلات .",
      ],
      correctAnswer:
        "الأخذ بعين الاعتبار عوامل المنافسة المستخدمة في اختيار الفنادق .",
    },
    {
      id: "7",
      question:
        "تقوم بالتخطيط لمدة ثلاث سنوات لتدقيق جميع الفروع لوكالة تأجير سيارات عالمية كبيرة . الإدارة مهتمة بشكل خاص بالعمليات المعيارية للمحاسبة وتأجير السيارات ، ووظائف المخزون . أي من نماذج برامج التدقيق تعتبر الأكثر ملاءمة من أجل هذا المشروع ؟",
      choices: [
        "وضع برنامج تدقيق موحد واختباره من قبل قسم التدقيق الداخلي .",
        "وضع برامج تدقيق فردية من قبل المدقق الموكل بالمهمة بعد الاستقصاء التمهيدي لكل فرع .",
        "وضع قائمة لإجراءات التشغيل المعيارية للفرع .",
        "دليل الإرشاد المطور للصناعة .",
      ],
      correctAnswer:
        "وضع برنامج تدقيق موحد واختباره من قبل قسم التدقيق الداخلي .",
    },

    {
      id: "8",
      question:
        "أي من التالي لا يعتبر عادة من المعايير الأساسية لإعداد برامج التدقيق ؟",
      choices: [
        "وصف أهداف عمليات الجهة الخاضعة للتدقيق كما هو متفق عليه مع الجهة الخاضعة للتدقيق .",
        "خصوصية الضوابط الرقابية التي ينبغي اختبارها . ",
        "خصوصية خطوات التدقيق التي يجب اتباعها .",
        "خصوصية المنهجية التي سيتم استخدامها من أجل خطوات عمل التدقيق .",
      ],
      correctAnswer:
        "خصوصية المنهجية التي سيتم استخدامها من أجل خطوات عمل التدقيق .",
    },
    {
      id: "9",
      question:
        "خلال إعداد برنامج التدقيق ، أي من العناصر التالية لا تعتبر أساسية ؟",
      choices: [
        "إجراءات الاستقصاء التمهيدي .",
        "مراجعة المواد والأدوات من تقارير التدقيق السابقة . ",
        "إعداد الموازنة التي تحدد تكاليف الموارد المطلوبة .",
        "مراجعة معايير التنفيذ الموضوعة من قبل الإدارة .",
      ],
      correctAnswer: "إعداد الموازنة التي تحدد تكاليف الموارد المطلوبة .",
    },
    {
      id: "10",
      question:
        "يجب على المدققين الداخليين التخطيط لكل تدقيق يقومون به وتوثيق ذلك التخطيط وتتضمن عملية التخطيط جميع الخطوات التالية ما عدا؟",
      choices: [
        "ملاحظة الظروف .",
        " مقابلة الأشخاص .",
        "فحص السجلات .",
        "حساب الانحرافات .",
      ],
      correctAnswer: "ملاحظة الظروف .",
    },
    {
      id: "11",
      question: `كجزء من عملية تدقيق الرواتب ، استخدم المدقق الداخلي استبيان الرقابة الداخلية وقد تم استلام ردود إيجابية لكل من الأسئلة التالية التي طرحت على مدير قسم الرواتب ؟

      1.      هل تحتاج الزيادات أو التغييرات في الرواتب إلى موافقة قسم الموارد البشرية ؟
      
      2.      هل تتم مطابقة مجاميع الشيكات مع بيانات سجل الرواتب قبل أن يتم توزيع الشيكات على الموظفين ؟
      
      3.      هل يتم تأدية وظيفة إعداد الرواتب ووظيفة توزيع الشيكات من قبل شخصين مختلفين ؟
      
      في أي مرحلة من مراحل التدقيق يقوم المدقق بالتأكد من هذه الردود ؟`,
      choices: [
        "التخطيط .",
        "الفحص والتقييم . ",
        "الاستقصاء الميداني .",
        "التحضير التمهيدي .",
      ],
      correctAnswer: "الفحص والتقييم .",
    },
    {
      id: "12",
      question:
        "تدرس الإدارة فكرة الحصول على نسخة أحدث من الحاسوب الرئيسي بهدف زيادة استطاعته ، لذلك تم الطلب من المدقق الداخلي القيام بعملية تدقيق لتحديد كفاءة مصادر المعالجة للحاسوب الحالي . ما هو مصدر المعلومات الأنسب لتحقيق الهدف من عملية التدقيق ؟",
      choices: [
        "استبيان لمدى رضاء المستخدمين الحاليين .",
        "مراجعة مهام الحاسوب وسجلاته وقوائم الأعمال المطلوبة وفترات الانقطاع .",
        "مقارنة استطاعة الحاسوب المركزي مع استطاعة الحاسوب العادي .",
        "تحليل مفصل لنمو وحدة القرص الصلب خلال السنوات الثلاث الأخيرة .",
      ],
      correctAnswer:
        "مراجعة مهام الحاسوب وسجلاته وقوائم الأعمال المطلوبة وفترات الانقطاع .",
    },
    {
      id: "13",
      question:
        "يجري التخطيط لتنفيذ تدقيق على قسم ضبط الجودة ، أي مما يلي من المستبعد استخدامه في استبيان الاستقصاء التمهيدي ؟",
      choices: [
        "تحليل المستندات الخاصة بضبط الجودة .",
        "ملف التدقيق الدائم . ",
        "تقرير التدقيق السابق .",
        "ميثاق الإدارة الخاص بقسم ضبط الجودة .",
      ],
      correctAnswer: "تحليل المستندات الخاصة بضبط الجودة .",
    },
    {
      id: "14",
      question:
        "ما هو التصرف الذي سيقوم به المدقق الداخلي عندما يكتشف وجود منطقة هامة تحتاج للتدقيق ولم يتم تضمينها في برنامج التدقيق ؟",
      choices: [
        "تقييم ما إذا كان إتمام التدقيق كما هو مخطط له سيكون ملائماً .",
        "القيام بالعمل الإضافي الذي يعتبر ضرورياً دون الأخذ بعين الاعتبار الوقت الإضافي الذي يحتاجه إتمام التدقيق .",
        "إتمام التدقيق كما هو مخطط له وإدراج المجال الذي لم تتم تغطيتها في خطة التدقيق اللاحقة .",
        "إدراج النتائج وتوثيقها في أوراق العمل وعدم القيام بأي عمل إضافي حتى يتم إصدار تعليمات بذلك .",
      ],
      correctAnswer:
        "تقييم ما إذا كان إتمام التدقيق كما هو مخطط له سيكون ملائماً .",
    },
    {
      id: "15",
      question:
        "يقوم مشرف التدقيق الداخلي بمراجعة نظام الرقابة والأهداف التنظيمية لقسم المشتريات . أي وجه من أوجه عملية التخطيط للتدقيق يقوم المشرف بتطويره ؟",
      choices: [
        "كتيب سياسات قسم التدقيق الداخلي .",
        "جدول عمل التدقيق . ",
        "برنامج التدقيق .",
        "موازنة التدقيق الداخلي .",
      ],
      correctAnswer: "برنامج التدقيق .",
    },
    {
      id: "16",
      question: "أحد الأدوار الرئيسية لبرنامج التدقيق هو ؟",
      choices: [
        "يساعد كأداة في التخطيط والتوجيه ، والرقابة على عمل التدقيق .",
        "يوثق فهم المدقق لنظم الرقابة الداخلية . ",
        "يوفر طرق معيارية لمهمة التدقيق .",
        "يقيم خطر التدقيق المقبول من قبل المدقق الداخلي .",
      ],
      correctAnswer:
        "يساعد كأداة في التخطيط والتوجيه ، والرقابة على عمل التدقيق .",
    },
    {
      id: "17",
      question: "أي من التالي يعتبر من خطوات برنامج التدقيق ؟",
      choices: [
        "بدء التدقيق خلال ستة أسابيع بما يتضمن اختبارات الالتزام .",
        "تحديد مدى فعالية وكفاءة عمليات التصنيع .",
        "عدم تقديم المدقق النتائج للأشخاص الذين لا يملكون الصلاحيات الإشرافية أو العملياتية خلال سير عملية التدقيق .",
        "استخدام الإجراءات للتأكد من ملاحظة وجود عناصر تتصف بخلل أو بعيب ما .",
      ],
      correctAnswer:
        "استخدام الإجراءات للتأكد من ملاحظة وجود عناصر تتصف بخلل أو بعيب ما .",
    },
    {
      id: "18",
      question:
        "أي من العبارات التالي هي الأكثر دقة في وصف كيفية وضع المعايير التي يستخدمها المدققون الداخليين في تحديد ما إذا تم تحقيق الأهداف؟",
      choices: [
        "الإدارة هي المسؤولة عن وضع المعايير .",
        "المدققين الداخليين يجب أن يستخدموا معايير مهنية أو تشريعات حكومية لوضع المعايير . ",
        "الصناعة التي تعمل ضمنها الشركة تضع المعايير لكل شركة عضو من خلال المقايسة والممارسة الأفضل لهذه الصناعة .",
        "يجب أن تستخدم مبادئ المحاسبة والتدقيق المناسبة كمعايير ، بما في ذلك المعايير الدولية .",
      ],
      correctAnswer: "الإدارة هي المسؤولة عن وضع المعايير .",
    },
    {
      id: "19",
      question: "أي مما يلي عبارة مناسبة كهدف لمهمة تدقيق ؟",
      choices: [
        "مراقبة الجرد الفعلي للمستودع .",
        "تحديد ما إذا كان حجم المخزون كافٍ لتلبية المبيعات المتوقعة . ",
        "إجراء بحث عن وجود مواد تالفة في المستودع عن طريق حساب معدل دوران المخزون لكل خط إنتاج .",
        "تضمين معلومات حول مخزون في التقارير النهائية للمهمة .",
      ],
      correctAnswer:
        "تحديد ما إذا كان حجم المخزون كافٍ لتلبية المبيعات المتوقعة .",
    },
    {
      id: "20",
      question:
        "يخطط المدقق الداخلي للقيام بتدقيق لمدى ملاءمة الرقابة على الاستثمار في أدوات مالية جديدة .أي من التالي لا يعتبر جزءً من هذه المهمة؟",
      choices: [
        "التأكد من وجود السياسات التي تصف المخاطر التي يأخذها مسؤول الخزينة بعين الاعتبار ونوع الأدوات التي من الممكن أن يستثمر بها .",
        "التأكد من مدى مراقبة الإدارة للاستثمارات في الأدوات المختلفة .",
        "التأكد من حصول المسؤول الخزينة على نسب أعلى أو أخفض على الاستثمارات مما تحصل عليه الشركات المماثلة .",
        "التأكد من طبيعة الرقابة التي يقوم مسؤول الخزينة بوضعها لمراقبة مخاطر الاستثمارات .",
      ],
      correctAnswer:
        "التأكد من حصول المسؤول الخزينة على نسب أعلى أو أخفض على الاستثمارات مما تحصل عليه الشركات المماثلة .",
    },
    {
      id: "21",
      question:
        "كوسيلة لضبط مشاريع التدقيق وتجنب تجاوز الزمن المقدر لاكتمال تنفيذ المهام ، يتم عادة تعديل الزمن المقدر لمهمة التدقيق ؟",
      choices: [
        "مباشرة بعد الانتهاء من الاستقصاء التمهيدي .",
        "عندما يتم إثبات وجود خلل هام .",
        "عندما يتم إسناد المهمة إلى كادر التدقيق غير خبير .",
        "مباشرة بعد توسيع الاختبارات لبناء موثوقية المشاهدات .",
      ],
      correctAnswer: "مباشرة بعد الانتهاء من الاستقصاء التمهيدي .",
    },
    {
      id: "22",
      question:
        "أي من أهداف التدقيق التالية يؤدي إلى اختبار فعالية استخدام الشركة لموارد العمالة ؟",
      choices: [
        "تحديد ما إذا جميع الموظفين يأخذون رواتبهم وفق المبالغ المحددة  من قبل نقابة العمال .",
        "تحديد ما إذا كان الموظفون يقومون بأعمال تتناسب مع مستوى التدريب الذي تلقوه والمهارات التي يتقنونها . ",
        "تحديد ما إذا كانت جودة الأداء التي يقوم بها العمال تلبي معايير الشركة .",
        "تحديد ما إذا الموظفون المعتمدون فقط هم من يحصلون على الرواتب .",
      ],
      correctAnswer:
        "تحديد ما إذا كان الموظفون يقومون بأعمال تتناسب مع مستوى التدريب الذي تلقوه والمهارات التي يتقنونها .",
    },
    {
      id: "23",
      question: `نفذ قسم التدقيق مهمة تدقيق لدورة النفقات في الشركة ، وكان الهدف من هذه المهمة هو تحديد ما إذا كانت جميع البضائع التي تم تسديد ثمنها قد تم استلامها وتحميلها على الحسابات الصحيحة . أي الأهداف الرئيسية المحددة في المعايير يحققه هدف مهمة التدقيق المذكورة ؟

      ·         موثوقية العمليات والمعلومات المالية .
      
      ·         التقيد بالقوانين والتنظيمات والعقود .
      
      ·         كفاءة وفعالية العمليات .
      
      ·         حماية أصول  الشركة .`,
      choices: [
        "1 و 2 فقط .",
        "1 و 4 فقط .",
        "1 و 2 و 4 فقط .",
        "2 و 3 , 4 فقط .",
      ],
      correctAnswer: "1 و 4 فقط .",
    },
    {
      id: "24",
      question:
        "كانت نتيجة التقييم الأولي الذي نفذه أحد المدققين الداخليين تشير إلى أن الإجراءات الرقابية يمكن أن تكون غير كافية . في هذه الحالة فإن الخطوة التالية ستكون ؟",
      choices: [
        "توسيع اعمال التدقيق قبل إعداد التقرير النهائي لمهمة التدقيق .",
        "إعداد مخطط تدفق يوضح نظام الرقابة الداخلية في المؤسسة .",
        "تسجيل ملاحظات حول هذا الأمر في التقرير النهائي لمهمة التدقيق في حال حدوث خسائر .",
        "تطبيق الإجراءات الرقابية التي يراها ضرورية .",
      ],
      correctAnswer:
        "توسيع اعمال التدقيق قبل إعداد التقرير النهائي لمهمة التدقيق .",
    },
    {
      id: "25",
      question:
        "لدى المدقق خبرة في مسألة جودة ونقاء الهواء . اثناء مقابلة مدير القسم الخاص بالبيئة والصحة والأمان ، اكتشف المدقق أن هناك عدم إلمام بالمتطلبات القانونية للرقابة على انبعاثات الهواء . يجب على المدقق أن ؟",
      choices: [
        "يغير من نطاق المهمة للتركيز على النشاطات المرتبطة بانبعاث الهواء .",
        "يشارك معلوماته الشخصية الشاملة مع مدير قسم البيئة والصحة والأمان .",
        "وضع ملاحظة حول هذا الضعف وتوجيه أسئلة مباشرة لتحديد الأثر المحتمل لنقص المعرفة .",
        "إبلاغ المخالفات المحتملة في هذه المنطقة للسلطات القانونية .",
      ],
      correctAnswer:
        "وضع ملاحظة حول هذا الضعف وتوجيه أسئلة مباشرة لتحديد الأثر المحتمل لنقص المعرفة .",
    },
    {
      id: "",
      question: "",
      choices: ["", " ", "", ""],
      correctAnswer: "",
    },
    {
      id: "",
      question: "",
      choices: ["", " ", "", ""],
      correctAnswer: "",
    },
    {
      id: "",
      question: "",
      choices: ["", " ", "", ""],
      correctAnswer: "",
    },
    {
      id: "",
      question: "",
      choices: ["", " ", "", ""],
      correctAnswer: "",
    },
    {
      id: "",
      question: "",
      choices: ["", " ", "", ""],
      correctAnswer: "",
    },
    {
      id: "",
      question: "",
      choices: ["", " ", "", ""],
      correctAnswer: "",
    },
    {
      id: "",
      question: "",
      choices: ["", " ", "", ""],
      correctAnswer: "",
    },
    {
      id: "",
      question: "",
      choices: ["", " ", "", ""],
      correctAnswer: "",
    },
    {
      id: "",
      question: "",
      choices: ["", " ", "", ""],
      correctAnswer: "",
    },
    {
      id: "",
      question: "",
      choices: ["", " ", "", ""],
      correctAnswer: "",
    },
    {
      id: "",
      question: "",
      choices: ["", " ", "", ""],
      correctAnswer: "",
    },
    {
      id: "",
      question: "",
      choices: ["", " ", "", ""],
      correctAnswer: "",
    },
    {
      id: "",
      question: "",
      choices: ["", " ", "", ""],
      correctAnswer: "",
    },
    {
      id: "",
      question: "",
      choices: ["", " ", "", ""],
      correctAnswer: "",
    },
    {
      id: "",
      question: "",
      choices: ["", " ", "", ""],
      correctAnswer: "",
    },
    {
      id: "",
      question: "",
      choices: ["", " ", "", ""],
      correctAnswer: "",
    },
    {
      id: "",
      question: "",
      choices: ["", " ", "", ""],
      correctAnswer: "",
    },
    {
      id: "",
      question: "",
      choices: ["", " ", "", ""],
      correctAnswer: "",
    },
    {
      id: "",
      question: "",
      choices: ["", " ", "", ""],
      correctAnswer: "",
    },
    {
      id: "",
      question: "",
      choices: ["", " ", "", ""],
      correctAnswer: "",
    },
    {
      id: "",
      question: "",
      choices: ["", " ", "", ""],
      correctAnswer: "",
    },
    {
      id: "",
      question: "",
      choices: ["", " ", "", ""],
      correctAnswer: "",
    },
    {
      id: "",
      question: "",
      choices: ["", " ", "", ""],
      correctAnswer: "",
    },
    {
      id: "",
      question: "",
      choices: ["", " ", "", ""],
      correctAnswer: "",
    },
    {
      id: "",
      question: "",
      choices: ["", " ", "", ""],
      correctAnswer: "",
    },
    {
      id: "",
      question: "",
      choices: ["", " ", "", ""],
      correctAnswer: "",
    },
    {
      id: "",
      question: "",
      choices: ["", " ", "", ""],
      correctAnswer: "",
    },
    {
      id: "",
      question: "",
      choices: ["", " ", "", ""],
      correctAnswer: "",
    },
    {
      id: "",
      question: "",
      choices: ["", " ", "", ""],
      correctAnswer: "",
    },
    {
      id: "",
      question: "",
      choices: ["", " ", "", ""],
      correctAnswer: "",
    },
    {
      id: "",
      question: "",
      choices: ["", " ", "", ""],
      correctAnswer: "",
    },
    {
      id: "",
      question: "",
      choices: ["", " ", "", ""],
      correctAnswer: "",
    },
    {
      id: "",
      question: "",
      choices: ["", " ", "", ""],
      correctAnswer: "",
    },
    {
      id: "",
      question: "",
      choices: ["", " ", "", ""],
      correctAnswer: "",
    },
    {
      id: "",
      question: "",
      choices: ["", " ", "", ""],
      correctAnswer: "",
    },
    {
      id: "",
      question: "",
      choices: ["", " ", "", ""],
      correctAnswer: "",
    },
    {
      id: "",
      question: "",
      choices: ["", " ", "", ""],
      correctAnswer: "",
    },
    {
      id: "",
      question: "",
      choices: ["", " ", "", ""],
      correctAnswer: "",
    },
    {
      id: "",
      question: "",
      choices: ["", " ", "", ""],
      correctAnswer: "",
    },
    {
      id: "",
      question: "",
      choices: ["", " ", "", ""],
      correctAnswer: "",
    },
    {
      id: "",
      question: "",
      choices: ["", " ", "", ""],
      correctAnswer: "",
    },
    {
      id: "",
      question: "",
      choices: ["", " ", "", ""],
      correctAnswer: "",
    },
    {
      id: "",
      question: "",
      choices: ["", " ", "", ""],
      correctAnswer: "",
    },
    {
      id: "",
      question: "",
      choices: ["", " ", "", ""],
      correctAnswer: "",
    },
    {
      id: "",
      question: "",
      choices: ["", " ", "", ""],
      correctAnswer: "",
    },
    {
      id: "",
      question: "",
      choices: ["", " ", "", ""],
      correctAnswer: "",
    },
    {
      id: "",
      question: "",
      choices: ["", " ", "", ""],
      correctAnswer: "",
    },
    {
      id: "",
      question: "",
      choices: ["", " ", "", ""],
      correctAnswer: "",
    },
    {
      id: "",
      question: "",
      choices: ["", " ", "", ""],
      correctAnswer: "",
    },
    {
      id: "",
      question: "",
      choices: ["", " ", "", ""],
      correctAnswer: "",
    },
    {
      id: "",
      question: "",
      choices: ["", " ", "", ""],
      correctAnswer: "",
    },
    {
      id: "",
      question: "",
      choices: ["", " ", "", ""],
      correctAnswer: "",
    },
    {
      id: "",
      question: "",
      choices: ["", " ", "", ""],
      correctAnswer: "",
    },
    {
      id: "",
      question: "",
      choices: ["", " ", "", ""],
      correctAnswer: "",
    },
    {
      id: "",
      question: "",
      choices: ["", " ", "", ""],
      correctAnswer: "",
    },
    {
      id: "",
      question: "",
      choices: ["", " ", "", ""],
      correctAnswer: "",
    },
    {
      id: "",
      question: "",
      choices: ["", " ", "", ""],
      correctAnswer: "",
    },
    {
      id: "",
      question: "",
      choices: ["", " ", "", ""],
      correctAnswer: "",
    },
    {
      id: "",
      question: "",
      choices: ["", " ", "", ""],
      correctAnswer: "",
    },
    {
      id: "",
      question: "",
      choices: ["", " ", "", ""],
      correctAnswer: "",
    },
    {
      id: "",
      question: "",
      choices: ["", " ", "", ""],
      correctAnswer: "",
    },
    {
      id: "",
      question: "",
      choices: ["", " ", "", ""],
      correctAnswer: "",
    },
    {
      id: "",
      question: "",
      choices: ["", " ", "", ""],
      correctAnswer: "",
    },
    {
      id: "",
      question: "",
      choices: ["", " ", "", ""],
      correctAnswer: "",
    },
    {
      id: "",
      question: "",
      choices: ["", " ", "", ""],
      correctAnswer: "",
    },
    {
      id: "",
      question: "",
      choices: ["", " ", "", ""],
      correctAnswer: "",
    },
    {
      id: "",
      question: "",
      choices: ["", " ", "", ""],
      correctAnswer: "",
    },
    {
      id: "",
      question: "",
      choices: ["", " ", "", ""],
      correctAnswer: "",
    },
    {
      id: "",
      question: "",
      choices: ["", " ", "", ""],
      correctAnswer: "",
    },
    {
      id: "",
      question: "",
      choices: ["", " ", "", ""],
      correctAnswer: "",
    },
    {
      id: "",
      question: "",
      choices: ["", " ", "", ""],
      correctAnswer: "",
    },
    {
      id: "",
      question: "",
      choices: ["", " ", "", ""],
      correctAnswer: "",
    },
    {
      id: "",
      question: "",
      choices: ["", " ", "", ""],
      correctAnswer: "",
    },
    {
      id: "",
      question: "",
      choices: ["", " ", "", ""],
      correctAnswer: "",
    },
    {
      id: "",
      question: "",
      choices: ["", " ", "", ""],
      correctAnswer: "",
    },
  ],
};
